## production: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2022-06-17T16:29:59Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:820252213580:2aluui7fbb/" -> (known after apply)
      ~ id            = "v99aci" -> (known after apply)
      ~ invoke_url    = "https://2aluui7fbb.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2022-06-17T16:29:59Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "v99aci" -> (known after apply)
        id                    = "ags-2aluui7fbb-production"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.covidshield_metrics_submission will be destroyed
  - resource "aws_route53_record" "covidshield_metrics_submission" {
      - fqdn    = "metrics.covid-notification.alpha.canada.ca" -> null
      - id      = "Z0046994R4Q28XNP6F7E_metrics.covid-notification.alpha.canada.ca_A" -> null
      - name    = "metrics.covid-notification.alpha.canada.ca" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "A" -> null
      - zone_id = "Z0046994R4Q28XNP6F7E" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d-vv80stzbxa.execute-api.ca-central-1.amazonaws.com" -> null
          - zone_id                = "Z19DQILCV0OWEC" -> null
        }
    }

Plan: 1 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ base_url = "https://2aluui7fbb.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>